import React from "react";
import { Modal } from "antd";
import ReactMarkdown from "react-markdown";
import rehypeRaw from "rehype-raw";

type RuleModalProps = {
  open: boolean;
  onCancel: () => void;
};

const contentText = `<h2 align="center">中奖规则</h2>
  <h3>一、根据购买者选择的3D的投注号码和投注方式，与当期开奖号码的相符情况，确定相应的中奖资格。具体规定如下：</h3>
  <h4>单选投注：</h4>
  <p>单选：投注号码与当期开奖号码按位全部相同（百位+十位+个位），即中奖。</p>
  <h4>组选投注：</h4>
  <p>1. 组选3：当期开奖号码的三位数中任意两位数字相同，且投注号码与当期开奖号码相同（顺序不限），即中奖。</p>
  <p>2. 组选6：当期开奖号码的三位数各不相同，且投注号码与当期开奖号码相同（顺序不限），即中奖。</p>
  <h4>1D投注：</h4>
  <p>1D：投注号码与当期开奖号码中对应位置的号码相同，即中奖。</p>
  <h4>猜1D投注：</h4>
  <p>1. 猜中1：投注号码与当期开奖号码中任意一个位置的号码相同，即中奖。</p>
  <p>2. 猜中2：投注号码与当期开奖号码中任意两个位置的号码相同，即中奖。</p>
  <p>3. 猜中3：投注号码与当期开奖号码中全部三个位置的号码相同，即中奖。</p>
  <h4>2D投注：</h4>
  <p>2D：投注号码与当期开奖号码中对应两个位置的号码按位相同，即中奖。</p>
  <h4>猜2D投注：</h4>
  <p>1. 两同号：投注号码为两个相同的号码，若当期开奖号码中包含投注的两个相同号码，即中奖。</p>
  <p>2. 两不同号：投注号码为两个不同的号码，若当期开奖号码中包含投注的两个不同号码（顺序不限），即中奖。</p>
  <h4>通选投注：</h4>
  <p>1. 通选1：投注号码与当期开奖号码按位全部相同（百位+十位+个位），即中奖。</p>
  <p>2. 通选2：投注号码与当期开奖号码中任意两个位置的号码按位相同，即中奖。</p>
  <h4>和数投注：</h4>
  <p>和数：投注号码与当期开奖号码的三个号码相加之和相同，即中奖。</p>
  <h4>和数投注：</h4>
  <p>和数：投注号码与当期开奖号码的三个号码相加之和相同，即中奖。</p>
  <h4>包选投注：</h4>
  <p>1. 包选3：</p>
  <p>（1）全中：投注号码的三位数中任意两位数字相同，且投注号码与当期开奖号码按位全部相同，即中奖。</p>
  <p>（2）组中：投注号码的三位数中任意两位数字相同，且投注号码与当期开奖号码全部相同（顺序不同），即中奖。</p>
  <p>2. 包选6：</p>
  <p>（1）全中：投注号码的三位数各不相同，且投注号码与当期开奖号码按位全部相同，即中奖。</p>
  <p>（2）组中：投注号码的三位数各不相同，且投注号码与当期开奖号码全部相同（顺序不同），即中奖。</p>
  <h4>猜大小投注：</h4>
  <p>猜大小：投注号码与当期开奖号码的三个号码相加之和的大、小性质相同，即中奖。其中，三个号码相加之和在19（含）至27（含）之间时为大，在0（含）至8（含）之间时为小。</p>
  <h4>猜三同投注：</h4>
  <p>猜三同：当期开奖号码为三个相同的号码，即中奖。</p>
  <h4>拖拉机投注：</h4>
  <p>拖拉机：当期开奖号码的三个号码为以升序或降序连续排列的号码（890、098、901、109除外），即中奖。</p>
  <h4>猜奇偶投注</h4>
  <p>猜奇偶：当期开奖号码的三个号码全部为奇数或偶数，且投注号码与当期开奖号码的三个号码的奇数、偶数性质相同，即中奖。其中，1、3、5、7、9为奇，0、2、4、6、8为偶。</p>
  <h3>二、当期每注投注号码按其投注方式只有一次中奖机会，不能兼中兼得，特别设奖除外。</h3>
  <h2 align="center">中奖奖金</h2>
  <h3>3D按不同单式投注方式设奖，均为固定奖。奖金规定如下：</h3>
  <h4>单选投注</h4>
  <p>单选：单注奖金固定为1040元。</p>
  <h4>组选投注</h4>
  <p>1. 组选3：单注奖金固定为346元。</p>
  <p>2. 组选6：单注奖金固定为173元。</p>
  <h4>1D投注：</h4>
  <p>1D：单注奖金固定为10元。</p>
  <h4>猜1D投注：</h4>
  <p>1. 猜中1：单注奖金固定为2元。</p>
  <p>2. 猜中2：单注奖金固定为12元。</p>
  <p>3. 猜中3：单注奖金固定为230元。</p>
  <h4>2D投注：</h4>
  <p>2D：单注奖金固定为104元。</p>
  <h4>猜2D投注：</h4>
  <p>1. 两同号：单注奖金固定为37元。</p>
  <p>2. 两不同号：单注奖金固定为19元。</p>
  <h4>通选投注：</h4>
  <p>1. 通选1：单注奖金固定为470元。</p>
  <p>2. 通选2：单注奖金固定为21元。</p>
  <h4>和数投注：</h4>
  <p>1. 和数0或27：单注奖金固定为1040元。</p>
  <p>2. 和数1或26：单注奖金固定为345元。</p>
  <p>3. 和数2或25：单注奖金固定为172元。</p>
  <p>4. 和数3或24：单注奖金固定为104元。</p>
  <p>5. 和数4或23：单注奖金固定为69元。</p>
  <p>6. 和数5或22：单注奖金固定为49元。</p>
  <p>7. 和数6或21：单注奖金固定为37元。</p>
  <p>8. 和数7或20：单注奖金固定为29元。</p>
  <p>9. 和数8或19：单注奖金固定为23元。</p>
  <p>10. 和数9或18：单注奖金固定为19元。</p>
  <p>11. 和数10或17：单注奖金固定为16元。</p>
  <p>12. 和数11或16：单注奖金固定为15元。</p>
  <p>13. 和数12或15：单注奖金固定为15元。</p>
  <p>14. 和数13或14：单注奖金固定为14元。</p>
  <h4>包选投注：</h4>
  <p>1. 包选3：</p>
  <p>（1）全中：单注奖金固定为693元。</p>
  <p>（2）组中：单注奖金固定为173元。</p>
  <p>1. 包选6：</p>
  <p>（1）全中：单注奖金固定为606元。</p>
  <p>（2）组中：单注奖金固定为86元。</p>
  <h4>猜大小投注：</h4>
  <p>猜大小：单注奖金固定为6元。</p>
  <h4>猜三同投注：</h4>
  <p>猜三同：单注奖金固定为104元。</p>
  <h4>拖拉机投注：</h4>
  <p>拖拉机：单注奖金固定为65元。</p>
  <h4>猜奇偶投注：</h4>
  <p>猜奇偶：单注奖金固定为8元。</p>
  <h2 align="center">兑奖规则</h2>
  <h3>一、3D兑奖当期有效。中奖者应当自开奖之日起60个自然日内，持中奖彩票到指定的地点兑奖。逾期未兑奖视为弃奖，弃奖奖金纳入彩票公益金。</h3>
  <h3>二、中奖彩票为中奖唯一凭证，中奖彩票因玷污、损坏等原因不能正确识别的，不能兑奖。</h3>
  <h3>三、兑奖机构可以查验中奖者的中奖彩票及有效身份证件，中奖者兑奖时应予配合。</h3>
  <strong>详细规则请前往<a href="https://www.cwl.gov.cn/c/2017/11/15/418903.shtml" target='_blank'>中国福利彩票官网</a>查看</strong>`;

const RuleModal = (props: RuleModalProps) => {
  const { open, onCancel } = props;

  const handleCancel = () => {
    onCancel();
  };

  return (
    <Modal
      title='游戏规则'
      width={1270}
      open={open}
      onCancel={handleCancel}
      footer={null}
    >
      <div
        style={{
          width: "100%",
          display: "flex",
          flexDirection: "column",
          overflowX: "auto",
        }}
      >
        <ReactMarkdown
          rehypePlugins={[rehypeRaw]}
          children={contentText}
          components={{
            h2(params) {
              const { children, ...rest } = params;
              return (
                <h2
                  style={{
                    fontSize: "20px",
                    lineHeight: "50px",
                    marginTop: "4px",
                  }}
                  {...rest}
                >
                  {children}
                </h2>
              );
            },
            h3(params) {
              const { children, ...rest } = params;
              return (
                <h3 style={{ fontSize: "16px", lineHeight: "40px" }} {...rest}>
                  {children}
                </h3>
              );
            },
            p(params) {
              const { children, ...rest } = params;
              return (
                <p
                  style={{
                    fontSize: "15px",
                    lineHeight: "36px",
                    textIndent: "2em",
                  }}
                  {...rest}
                >
                  {children}
                </p>
              );
            },
            strong(params) {
              const { children, ...rest } = params;
              return (
                <strong
                  style={{
                    fontWeight: "500",
                    fontSize: "15px",
                    lineHeight: "20px",
                    marginTop: "20px",
                    color: "#555555",
                  }}
                  {...rest}
                >
                  {children}
                </strong>
              );
            },
          }}
        />
      </div>
    </Modal>
  );
};

export default RuleModal;
